#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols: + create Terraform will perform the following actions: # azurerm_log_analytics_workspace.law will be created + resource "azurerm_log_analytics_workspace" "law" { + allow_resource_only_permissions = true + daily_quota_gb = -1 + id = (known after apply) + internet_ingestion_enabled = true + internet_query_enabled = true + local_authentication_disabled = false + location = "eastus" + name = "globomaticdeveuslaw" + primary_shared_key = (sensitive value) + resource_group_name = "globomatic-eus-dev-01" + retention_in_days = (known after apply) + secondary_shared_key = (sensitive value) + sku = (known after apply) + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } + workspace_id = (known after apply) } # azurerm_monitor_diagnostic_setting.dgs will be created + resource "azurerm_monitor_diagnostic_setting" "dgs" { + id = (known after apply) + log_analytics_destination_type = (known after apply) + log_analytics_workspace_id = (known after apply) + name = "globomaticdeveusfuncdgs" + target_resource_id = (known after apply) + enabled_log (known after apply) + log (known after apply) + metric { + category = "AllMetrics" + enabled = true } } # random_integer.sa will be created + resource "random_integer" "sa" { + id = (known after apply) + max = 999 + min = 100 + result = (known after apply) } # module.funcapp01.azurerm_linux_function_app.azfuncapp will be created + resource "azurerm_linux_function_app" "azfuncapp" { + app_settings = { + "FUNCTIONS_WORKER_RUNTIME" = "python" } + builtin_logging_enabled = true + client_certificate_enabled = false + client_certificate_mode = "Optional" + content_share_force_disabled = false + custom_domain_verification_id = (sensitive value) + daily_memory_time_quota = 0 + default_hostname = (known after apply) + enabled = true + ftp_publish_basic_authentication_enabled = true + functions_extension_version = "~4" + hosting_environment_id = (known after apply) + https_only = false + id = (known after apply) + key_vault_reference_identity_id = (known after apply) + kind = (known after apply) + location = "eastus" + name = "globomaticdeveusfun" + outbound_ip_address_list = (known after apply) + outbound_ip_addresses = (known after apply) + possible_outbound_ip_address_list = (known after apply) + possible_outbound_ip_addresses = (known after apply) + public_network_access_enabled = true + resource_group_name = "globomatic-eus-dev-01" + service_plan_id = (known after apply) + site_credential = (sensitive value) + storage_account_access_key = (sensitive value) + storage_account_name = (known after apply) + storage_uses_managed_identity = false + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } + webdeploy_publish_basic_authentication_enabled = true + zip_deploy_file = (known after apply) + site_config { + always_on = (known after apply) + app_scale_limit = (known after apply) + container_registry_use_managed_identity = false + default_documents = (known after apply) + detailed_error_logging_enabled = (known after apply) + elastic_instance_minimum = (known after apply) + ftps_state = "Disabled" + health_check_eviction_time_in_min = (known after apply) + http2_enabled = false + ip_restriction_default_action = "Allow" + linux_fx_version = (known after apply) + load_balancing_mode = "LeastRequests" + managed_pipeline_mode = "Integrated" + minimum_tls_version = "1.2" + pre_warmed_instance_count = (known after apply) + remote_debugging_enabled = false + remote_debugging_version = (known after apply) + scm_ip_restriction_default_action = "Allow" + scm_minimum_tls_version = "1.2" + scm_type = (known after apply) + scm_use_main_ip_restriction = false + use_32_bit_worker = false + vnet_route_all_enabled = false + websockets_enabled = false + worker_count = (known after apply) + application_stack { + python_version = "3.10" + use_dotnet_isolated_runtime = false } } } # module.funcapp01.azurerm_service_plan.azfuncsp will be created + resource "azurerm_service_plan" "azfuncsp" { + id = (known after apply) + kind = (known after apply) + location = "eastus" + maximum_elastic_worker_count = (known after apply) + name = "globomaticdeveusfun" + os_type = "Linux" + per_site_scaling_enabled = false + reserved = (known after apply) + resource_group_name = "globomatic-eus-dev-01" + sku_name = "Y1" + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } + worker_count = (known after apply) } # module.funcapp01.azurerm_storage_account.safunc will be created + resource "azurerm_storage_account" "safunc" { + access_tier = (known after apply) + account_kind = "StorageV2" + account_replication_type = "LRS" + account_tier = "Standard" + allow_nested_items_to_be_public = true + cross_tenant_replication_enabled = true + default_to_oauth_authentication = false + dns_endpoint_type = "Standard" + enable_https_traffic_only = true + id = (known after apply) + infrastructure_encryption_enabled = false + is_hns_enabled = false + large_file_share_enabled = (known after apply) + local_user_enabled = true + location = "eastus" + min_tls_version = "TLS1_2" + name = (known after apply) + nfsv3_enabled = false + primary_access_key = (sensitive value) + primary_blob_connection_string = (sensitive value) + primary_blob_endpoint = (known after apply) + primary_blob_host = (known after apply) + primary_blob_internet_endpoint = (known after apply) + primary_blob_internet_host = (known after apply) + primary_blob_microsoft_endpoint = (known after apply) + primary_blob_microsoft_host = (known after apply) + primary_connection_string = (sensitive value) + primary_dfs_endpoint = (known after apply) + primary_dfs_host = (known after apply) + primary_dfs_internet_endpoint = (known after apply) + primary_dfs_internet_host = (known after apply) + primary_dfs_microsoft_endpoint = (known after apply) + primary_dfs_microsoft_host = (known after apply) + primary_file_endpoint = (known after apply) + primary_file_host = (known after apply) + primary_file_internet_endpoint = (known after apply) + primary_file_internet_host = (known after apply) + primary_file_microsoft_endpoint = (known after apply) + primary_file_microsoft_host = (known after apply) + primary_location = (known after apply) + primary_queue_endpoint = (known after apply) + primary_queue_host = (known after apply) + primary_queue_microsoft_endpoint = (known after apply) + primary_queue_microsoft_host = (known after apply) + primary_table_endpoint = (known after apply) + primary_table_host = (known after apply) + primary_table_microsoft_endpoint = (known after apply) + primary_table_microsoft_host = (known after apply) + primary_web_endpoint = (known after apply) + primary_web_host = (known after apply) + primary_web_internet_endpoint = (known after apply) + primary_web_internet_host = (known after apply) + primary_web_microsoft_endpoint = (known after apply) + primary_web_microsoft_host = (known after apply) + public_network_access_enabled = true + queue_encryption_key_type = "Service" + resource_group_name = "globomatic-eus-dev-01" + secondary_access_key = (sensitive value) + secondary_blob_connection_string = (sensitive value) + secondary_blob_endpoint = (known after apply) + secondary_blob_host = (known after apply) + secondary_blob_internet_endpoint = (known after apply) + secondary_blob_internet_host = (known after apply) + secondary_blob_microsoft_endpoint = (known after apply) + secondary_blob_microsoft_host = (known after apply) + secondary_connection_string = (sensitive value) + secondary_dfs_endpoint = (known after apply) + secondary_dfs_host = (known after apply) + secondary_dfs_internet_endpoint = (known after apply) + secondary_dfs_internet_host = (known after apply) + secondary_dfs_microsoft_endpoint = (known after apply) + secondary_dfs_microsoft_host = (known after apply) + secondary_file_endpoint = (known after apply) + secondary_file_host = (known after apply) + secondary_file_internet_endpoint = (known after apply) + secondary_file_internet_host = (known after apply) + secondary_file_microsoft_endpoint = (known after apply) + secondary_file_microsoft_host = (known after apply) + secondary_location = (known after apply) + secondary_queue_endpoint = (known after apply) + secondary_queue_host = (known after apply) + secondary_queue_microsoft_endpoint = (known after apply) + secondary_queue_microsoft_host = (known after apply) + secondary_table_endpoint = (known after apply) + secondary_table_host = (known after apply) + secondary_table_microsoft_endpoint = (known after apply) + secondary_table_microsoft_host = (known after apply) + secondary_web_endpoint = (known after apply) + secondary_web_host = (known after apply) + secondary_web_internet_endpoint = (known after apply) + secondary_web_internet_host = (known after apply) + secondary_web_microsoft_endpoint = (known after apply) + secondary_web_microsoft_host = (known after apply) + sftp_enabled = false + shared_access_key_enabled = true + table_encryption_key_type = "Service" + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } + blob_properties (known after apply) + network_rules (known after apply) + queue_properties (known after apply) + routing (known after apply) + share_properties (known after apply) } # module.kv.azurerm_key_vault.azkv01 will be created + resource "azurerm_key_vault" "azkv01" { + access_policy = (known after apply) + id = (known after apply) + location = "eastus" + name = (known after apply) + public_network_access_enabled = true + resource_group_name = "globomatic-eus-dev-01" + sku_name = "standard" + soft_delete_retention_days = 90 + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } + tenant_id = "a618cda7-d591-41f5-8ff9-6ddea7e31dc2" + vault_uri = (known after apply) + contact (known after apply) + network_acls (known after apply) } # module.sa.azurerm_storage_account.azsa will be created + resource "azurerm_storage_account" "azsa" { + access_tier = (known after apply) + account_kind = "StorageV2" + account_replication_type = "LRS" + account_tier = "Standard" + allow_nested_items_to_be_public = true + cross_tenant_replication_enabled = true + default_to_oauth_authentication = false + dns_endpoint_type = "Standard" + enable_https_traffic_only = true + id = (known after apply) + infrastructure_encryption_enabled = false + is_hns_enabled = false + large_file_share_enabled = (known after apply) + local_user_enabled = true + location = "eastus" + min_tls_version = "TLS1_2" + name = (known after apply) + nfsv3_enabled = false + primary_access_key = (sensitive value) + primary_blob_connection_string = (sensitive value) + primary_blob_endpoint = (known after apply) + primary_blob_host = (known after apply) + primary_blob_internet_endpoint = (known after apply) + primary_blob_internet_host = (known after apply) + primary_blob_microsoft_endpoint = (known after apply) + primary_blob_microsoft_host = (known after apply) + primary_connection_string = (sensitive value) + primary_dfs_endpoint = (known after apply) + primary_dfs_host = (known after apply) + primary_dfs_internet_endpoint = (known after apply) + primary_dfs_internet_host = (known after apply) + primary_dfs_microsoft_endpoint = (known after apply) + primary_dfs_microsoft_host = (known after apply) + primary_file_endpoint = (known after apply) + primary_file_host = (known after apply) + primary_file_internet_endpoint = (known after apply) + primary_file_internet_host = (known after apply) + primary_file_microsoft_endpoint = (known after apply) + primary_file_microsoft_host = (known after apply) + primary_location = (known after apply) + primary_queue_endpoint = (known after apply) + primary_queue_host = (known after apply) + primary_queue_microsoft_endpoint = (known after apply) + primary_queue_microsoft_host = (known after apply) + primary_table_endpoint = (known after apply) + primary_table_host = (known after apply) + primary_table_microsoft_endpoint = (known after apply) + primary_table_microsoft_host = (known after apply) + primary_web_endpoint = (known after apply) + primary_web_host = (known after apply) + primary_web_internet_endpoint = (known after apply) + primary_web_internet_host = (known after apply) + primary_web_microsoft_endpoint = (known after apply) + primary_web_microsoft_host = (known after apply) + public_network_access_enabled = true + queue_encryption_key_type = "Service" + resource_group_name = "globomatic-eus-dev-01" + secondary_access_key = (sensitive value) + secondary_blob_connection_string = (sensitive value) + secondary_blob_endpoint = (known after apply) + secondary_blob_host = (known after apply) + secondary_blob_internet_endpoint = (known after apply) + secondary_blob_internet_host = (known after apply) + secondary_blob_microsoft_endpoint = (known after apply) + secondary_blob_microsoft_host = (known after apply) + secondary_connection_string = (sensitive value) + secondary_dfs_endpoint = (known after apply) + secondary_dfs_host = (known after apply) + secondary_dfs_internet_endpoint = (known after apply) + secondary_dfs_internet_host = (known after apply) + secondary_dfs_microsoft_endpoint = (known after apply) + secondary_dfs_microsoft_host = (known after apply) + secondary_file_endpoint = (known after apply) + secondary_file_host = (known after apply) + secondary_file_internet_endpoint = (known after apply) + secondary_file_internet_host = (known after apply) + secondary_file_microsoft_endpoint = (known after apply) + secondary_file_microsoft_host = (known after apply) + secondary_location = (known after apply) + secondary_queue_endpoint = (known after apply) + secondary_queue_host = (known after apply) + secondary_queue_microsoft_endpoint = (known after apply) + secondary_queue_microsoft_host = (known after apply) + secondary_table_endpoint = (known after apply) + secondary_table_host = (known after apply) + secondary_table_microsoft_endpoint = (known after apply) + secondary_table_microsoft_host = (known after apply) + secondary_web_endpoint = (known after apply) + secondary_web_host = (known after apply) + secondary_web_internet_endpoint = (known after apply) + secondary_web_internet_host = (known after apply) + secondary_web_microsoft_endpoint = (known after apply) + secondary_web_microsoft_host = (known after apply) + sftp_enabled = false + shared_access_key_enabled = true + table_encryption_key_type = "Service" + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } + blob_properties (known after apply) + network_rules (known after apply) + queue_properties (known after apply) + routing (known after apply) + share_properties (known after apply) } # module.vnet.azurerm_subnet.azsnet01 will be created + resource "azurerm_subnet" "azsnet01" { + address_prefixes = [ + "10.0.1.0/24", ] + enforce_private_link_endpoint_network_policies = (known after apply) + enforce_private_link_service_network_policies = (known after apply) + id = (known after apply) + name = "globomaticdeveussnet" + private_endpoint_network_policies = (known after apply) + private_endpoint_network_policies_enabled = (known after apply) + private_link_service_network_policies_enabled = (known after apply) + resource_group_name = "globomatic-eus-dev-01" + virtual_network_name = "globomaticdeveusvnet" } # module.vnet.azurerm_virtual_network.azvn01 will be created + resource "azurerm_virtual_network" "azvn01" { + address_space = [ + "10.0.0.0/16", ] + dns_servers = (known after apply) + guid = (known after apply) + id = (known after apply) + location = "eastus" + name = "globomaticdeveusvnet" + resource_group_name = "globomatic-eus-dev-01" + subnet = (known after apply) + tags = { + "billing_code" = "CeCo2326" + "environment" = "dev" + "project_name" = "globomatic" } } Plan: 10 to add, 0 to change, 0 to destroy. Changes to Outputs: + kv_name = (known after apply) + saname = (known after apply)
```

</details>

*Pusher: @Dalua96, Action: `pull_request`, Working Directory: ``, Workflow: `Validate and Plan Terraform code`*